app/controllers/bulletins_controller.rb

SELECT "bulletins".* FROM "bulletins"
---
  def index
    @bulletins = Bulletin.all

SELECT "bulletins".* FROM "bulletins" WHERE "bulletins"."id" = ? LIMIT 1  [["id", "index"]]
---
  def show
    @bulletin = Bulletin.find(params[:id])

SELECT "bulletins".* FROM "bulletins" WHERE "bulletins"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @bulletin = Bulletin.find(params[:id])

INSERT INTO "bulletins" ("created_at", "date", "deadline", "msg", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @bulletin = Bulletin.new(params[:bulletin])

    respond_to do |format|
      if @bulletin.save

SELECT "bulletins".* FROM "bulletins" WHERE "bulletins"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "bulletins" SET "msg" = 'testtest', "updated_at" = '2013-01-05 08:25:51.032781' WHERE "bulletins"."id" = 2
---
  def update
    @bulletin = Bulletin.find(params[:id])

    respond_to do |format|
      if @bulletin.update_attributes(params[:bulletin])

SELECT "bulletins".* FROM "bulletins" WHERE "bulletins"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "bulletins" WHERE "bulletins"."id" = ?  [["id", 2]]
---
  def destroy
    @bulletin = Bulletin.find(params[:id])
    @bulletin.destroy